# λ-calculus :: Index of λ-calculus rules

```js
// STLC typing rules

(x : τ) ∈ Γ
------------- VAR
Γ |- x : τ

Γ, x : τ |- M : σ
------------------------- ABS
Γ |- (λx : τ. M) : τ → σ

Γ |- M : τ -> σ    Γ |- N : τ
-------------------------------- APP
Γ |- M N : σ


// STLC typing rules

𝔁: σ ∈ Γ
------------ (1)           ------- AS
Γ |- 𝔁: σ                  σ |- σ


𝚌𝚘𝚗𝚜𝚝 𝓬: T
------------ (2)
Γ |- 𝓬: T


Γ, 𝔁 : σ |- 𝓮 : τ                     Γ, σ |- τ
-------------------------- (3)        ------------- →I
Γ |- (λ𝔁:σ. 𝓮): σ → τ                 Γ |- σ -> τ


Γ |- f:σ -> τ   Γ |- e:σ              Γ |- σ → τ    Γ |- σ
-------------------------- (4)        --------------------- →E (MP)
Γ |- f e : τ                          Γ |- τ


// The big-step evaluation rules of STLC

  e ⇓ v
--------- (1)       ----- (2)
e : τ ⇓ v           x ⇓ x


e ⇓ λx -> v     v [x ⟼ e'] ⇓ e'
--------------------------------- (3)
          e e' ⇓ v'


e ⇓ n    e' ⇓ v'                 e ⇓ v
---------------- (4)       ----------------- (5)
   e e' ⇓ n v'             λx -> e ⇓ λx -> v


// STLC:
// a term may only depend on a term
Γ, x : σ |- T : τ
----------------------- (λ)
Γ |- (λx. T) : σ → τ

// System F:
// * A term may depend on a term
// * A term may depend on type
Γ |- T : σ
----------------------- (Λ)     if α ∉ FV(Γ)
Γ |- (Λα. T) : Πα. σ


```
